{
  "metadata": "whyHaHas for jokes in the whyHaHa collection",
  "jokes": [
    {
      "id": "1",
      "joke": "Where do generals keep their armies? In their sleevies!",
      "whyHaHa": "A pun playing on the similar pronunciation of 'armies' and 'sleevies' (sleeves)."
    },
    {
      "id": "2",
      "joke": "I'm thinking of reasons to go to Switzerland. The flag is a big plus.",
      "whyHaHa": "A play on words where 'plus' has a double meaning: as an advantage and as the Swiss flag. The joke takes a literal interpretation of 'plus' in the context of Switzerland."
    },
    {
      "id": "3",
      "joke": "I didn't like my beard at first. Then it grew on me.",
      "whyHaHa": "A clever play on words with the phrase 'grew on me', having two meanings: the literal growth of the beard and the figurative meaning of becoming fond of something over time."
    },
    {
      "id": "4",
      "joke": "Why don't you starve in the desert? Because of the sand which is there.",
      "whyHaHa": "A non sequitur joke with an intentionally nonsensical punchline. The humor comes from the absurdity of suggesting sand as a reason for not starving. This is peak comedy btw."
    },
    {
      "id": "5",
      "joke": "Why can't a bicycle stand on its own? It's two-tired.",
      "whyHaHa": "A classic pun playing on the homophone 'tired'. 'Two-tired' sounds like 'too tired' while also describing a bicycle's two wheels."
    },
    {
      "id": "6",
      "joke": "Found out I was color blind the other day. That one came right out of the orange.",
      "whyHaHa": "A play on the double meaning of 'came out of the orange': literally referring to the color orange, while figuratively playing on the phrase 'came out of the blue' meaning something unexpected."
    },
    {
      "id": "7",
      "joke": "A burger walks into a bar. The bartender says 'Sorry, we don't serve food here'",
      "whyHaHa": "A classic setup for a joke where the punchline comes from the unexpected literal interpretation of 'we don't serve food' when a food item (burger) is the one asking."
    },
    {
      "id": "8",
      "joke": "What's more amazing than a talking dog? A spelling bee.",
      "whyHaHa": "A play on words where 'spelling bee' is both a type of insect and a competition for spelling. The joke works because bees can't talk, but they can spell (their name)."
    },
    {
      "id": "9",
      "joke": "Orion's Belt is a huge waist of space.",
      "whyHaHa": "A pun on the constellation Orion's Belt, where 'waist' is a play on words with 'waste', making a humorous connection between the celestial belt and a person's waistline."
    },
    {
      "id": "10",
      "joke": "Why was 6 afraid of 7? Because 7, 8, 9!",
      "whyHaHa": "A play on the phrase '7 ate 9' (7 ate 9), which sounds like '7, 8, 9' when spoken quickly."
    },
    {
      "id": "11",
      "joke": "There are only 10 types of people in the world: those who understand binary, and those who don't.",
      "whyHaHa": "00110001 00110000 00100000 01101101 01100001 01111001 00100000 01101100 01101111 01101111 01101011 00100000 01101100 01101001 01101011 01100101 00100000 00110001 00110000 00100000 01101001 01101110 00100000 01100100 01100101 01100011 01101001 01101101 01100001 01101100 00100000 01100010 01110101 01110100 00100000 01101001 01110100 00100000 01101001 01110011 00100000 00110010 00100000 01101001 01101110 00100000 01100010 01101001 01101110 01100001 01110010 01111001"
    }
  ]
}
